public_html/BooksReview/TheC-ProgrammingLanguage/Errata.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Errata for The C Programming Language, Second Edition</title>
<!-- 2017-01-26 Thu 21:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Errata for The C Programming Language, Second Edition</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Changes between first and second printing:</a></li>
<li><a href="#sec-2">Errors not corrected in any printing:</a></li>
</ul>
</div>
</div>
<p>
This lists all known errors in The C Programming Language, Second Edition, by Brian Kernighan and Dennis Ritchie (Prentice-Hall, 1988).
</p>

<p>
The pagination of the book has changed only in minor ways across printings of the English-language edition. These errata now include section numbers, which are more likely to be preserved across translations. This might help identify errors that survive into translated editions. 
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Changes between first and second printing:</h2>
<div class="outline-text-2" id="text-1">
<p>
The first printing of the book was made before the Standard was finalized; these copies say “Based on Draft-Proposed ANSI C” on the front cover. All subsequent printings are identified by a large red “ANSI C” on the right center of the cover. Fortunately, the changes are minor; some repair our bugs, a few account for last-minute changes in the draft standard. These changes were made so early that they probably do not apply to you.
</p>

<p>
Two or three sentences in the Preface and Introduction are updated to describe the state of the Standard.
</p>

<p>
atof is in stdlib.h, not math.h; this changes pages 71(§4.2), 76(§4.2), 82(§4.7), 121(§5.11).
</p>

<p>
On page 86(§4.9), error corrected: missing automatic initializers are zero too.
</p>

<p>
On page 168(§7.8.7): changed 1 to 1.0 in frand example to avoid potential overflow.
</p>

<p>
Minor typos are corrected on pages 87(§4.10), 89(§4.11.12), 164(§7.6), 165)§7.7), 168(§7.8.7), 180(§8.6).
</p>

<p>
In particular, the comment on p. 180(§8.6) attached to st<sub>ctime</sub> in the stat structure is repaired: “ctime” stands for “change time” not “created time”.
</p>

<p>
The inconspicuous references to noalias on pages 192(§A.2.4) and 211 or 212(§A8.2) are removed.
</p>

<p>
The following paragraph is added to the end of section A6.6 (page 199):
</p>

<p>
“A pointer may be converted to another pointer whose type is the same except for the addition or removal of qualifiers (A4.4, A8.2) of the object type to which the pointer refers. If qualifiers are added, the new pointer is equivalent to the old except for restrictions implied by the new qualifiers. If qualifiers are removed, operations on the underlying object remain subject to the qualifiers in its actual declaration.”
</p>

<p>
On page 199, beginning of §A6.8, “Any pointer may be converted to type void *…” is changed to “Any pointer to an object may be converted to type void *…”.
</p>

<p>
On page 204, §A7.4.4, “The operand of the unary + operator must have arithmetic or pointer type…” should read “must have arithmetic type…”.
</p>

<p>
On page 206, §A7.9, about relational operators: “Pointers to objects of the same type may be compared…” is changed to “Pointers to object of the same type (ignoring any qualifiers) may be compared…”.
</p>

<p>
The indented material on page 209(§A7.17), “According to the restrictions… relaxing it.” is removed. [This is related to the paragraph added above. The wording of the penultimate draft made it useless to take an (int *) pointer, cast it to (const int *), then cast it back to (int *).]
</p>

<p>
On page 219 middle (§A8.7), initialization of structures, add “Unnamed bit-field members are ignored, and are not initialized.”
</p>

<p>
Appendix B changes:
</p>

<p>
p 242(§B1.1): Add “fflush(NULL) flushes all output streams.” to fflush description.
</p>

<p>
p 243(§B1.1): Change to “it must be called before reading, writing or any other operation” in setvbuf description.
</p>

<p>
p 249(§B.3): Add “Comparison functions treat arguments as unsigned char arrays.” to string.h description.
</p>

<p>
p 255(§B10): Change range of tm<sub>sec</sub> to (0,61) for leap seconds.
</p>

<p>
p 255(§B.10): Change CLK<sub>TCK</sub> to CLOCKS<sub>PER</sub><sub>SEC</sub>.
</p>

<p>
p 257(§B11): Drop U and L suffixes from limits.h constants. tm<sub>sec</sub> range is (0,61) here too (§B10).
</p>

<p>
Appendix C change:
</p>

<p>
p 261(§C): Change “External declarations without any specifiers…” to “External data declarations without any specifiers…”.
</p>

<p>
The index has been reprinted to fix a couple of typos and account for motion within Appendix A; one page of the table of contents is changed.
</p>

<p>
A later printing in October, 1989, made minor changes on page 131(§6.2) to add &amp; to the last example ( struct rect r, *rp = &amp;r;), on page 208(§A.17) to change “equal” to “unequal” in the description of logical OR, and on page 254(§B.8) to clarify that for automatics variables, only those declared volatile are restored to their latest values after a setjmp / longjmp sequence.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Errors not corrected in any printing:</h2>
<div class="outline-text-2" id="text-2">
<p>
The following errors have not yet been fixed in any printing.
</p>

<p>
41(§2.6): The loop at the bottom of the page is functionally equivalent to the one on page 29(§1.9), but not identical in form, as is implied by the text.
</p>

<p>
44(§2.7): 1U is an unsigned int, not an int.
</p>

<p>
49(§2.9): In the discussion of shift operators, `which must be positive’ should be `which must be non-negative’.
</p>

<p>
53(§2.12): The note under the table should say &amp; as well as + – * has higher precedence as a unary operator.
</p>

<p>
102(§5.4): NULL is standardly defined in &lt;stddef.h&gt;, although it also appears in several other headers like &lt;stdio.h&gt; and &lt;stdlib.h&gt;.
</p>

<p>
111(§5.7): Indent is too large, and a bit of the month<sub>day</sub> program text is cut off.
</p>

<p>
114(§5.9): quote missing in "Jan, near top of page.
</p>

<p>
117(§5.10): In the find example, the program increments <code>argv[0]</code>. This is not specifically forbidden, but not specifically allowed either.
</p>

<p>
119-121(§5.11): The qsort discussion needs recasting in several ways. First, qsort is a standard routine in ANSI/ISO C, so the rendition here should be given a different name, especially because the arguments to standard qsort are a bit different: the standard accepts a base pointer and a count, while this example uses a base pointer and two offsets.
</p>

<p>
Also, the comparison-routine argument is not treated well. The call shown on p 119, with an argument
</p>

<p>
  (int (<b>)(void</b>,void*))(numeric? numcmp : strcmp)
is not only complicated, but only barely passes muster. Both numcmp and strcmp take char * arguments, but this expression casts pointers to these functions to a function pointer that takes void * arguments. The standard does say that void * and char * have the same representation, so the example will almost certainly work in practice, and is at least defensible under the standard. There are too many lessons in these pages.
</p>

<p>
136(§6.3) The getword function can overflow word by one character. A sufficient fix is to test ‘–lim&gt;1′ instead of ‘&gt;0′ in the for loop.
</p>

<p>
142(§6.5, toward the end): The remark about casting the return value of malloc (“the proper method is to declare … then explicitly coerce”) needs to be rewritten. The example is correct and works, but the advice is debatable in the context of the 1988-1989 ANSI/ISO standards. It’s not necessary (given that coercion of void * to ALMOSTANYTYPE * is automatic), and possibly harmful if malloc, or a proxy for it, fails to be declared as returning void *. The explicit cast can cover up an unintended error. On the other hand, pre-ANSI, the cast was necessary, and it is in C++ also.
</p>

<p>
143(§6.5): strdup is not indexed.
</p>

<p>
154(§7.2) table 7-1: arguments corresponding to o, x, X, u should be described as unsigned int.
</p>

<p>
158(§7.4) table 7-2: type of arguments corresponding to o, x should be unsigned int *.
</p>

<p>
164,165(§7.7): (text and code) fputs returns EOF on error, non-negative for OK.
</p>

<p>
165(§7.7): The comment at the beginning of the fgets example, “get at most n chars” would be better written “get at most n-1 chars, plus a null”.
</p>

<p>
167(§7.8.5): [the return value of malloc or calloc] “must be cast into the appropriate type” is incorrect as stated. See the remarks just above for p. 142.
</p>

<p>
176-178(§8.5): <code>OPEN_MAX</code> is used to define the largest number of simultaneously open files in the example stdio.h; the ANSI/ISO name for this is instead FOPEN<sub>MAX</sub>.
</p>

<p>
187-188(§8.7): malloc and the accompanying routine morecore are not presented as a whole program, and the routines should be OK, but moving the declaration
static Header *morecore(unsigned);
to file scope (instead of inside malloc) would be a better way to make sure scope and linkage issues are handled properly.
</p>

<p>
193(§A.2.5.1): If an integer constant is suffixed with UL, it is unsigned long.
</p>

<p>
195(§A4): To the list at the start of the section, “Identifiers, or names, refer to a variety of things…”, add labels as well.
</p>

<p>
195(§A4.1) The first few sentences might be reworded a bit to emphasize that there is a distinction between storage duration and scope, though both are influenced by explicit and implicit storage-class specifiers.
</p>

<p>
197(§A5): “An object is a named region of storage…” should read “named or pointed-to region…”
</p>

<p>
200(§ A7.1): The actual list of operators that prevent the conversion of arrays into pointers is just &amp; and sizeof, not the various assignment operators. In practice this is not important, because arrays (converted or not) cannot be assigned to for other reasons.
</p>

<p>
207 (§A7.10): add to first paragraph: equality operators on pointers may also be applied to pointers to different objects.
</p>

<p>
229(§A12.3), 239(§A13): Syntax: the argument list is optional (can be empty) in macro definitions with parentheses.
</p>

<p>
231(§A12.3): Extra right parenthesis in nested call to cat macro.
</p>

<p>
232(§A12.5): The result of the defined operator is not replaced literally by 0L or 1L, nor are undefined names literally by 0L, but just by plain 0 or 1. However, the constant expression is nevertheless evaluated as if these and other constants appearing have long or unsigned long type.
</p>

<p>
232(§A12.5), likewise on p. 239(§A13), in the sections on the pseudo-grammar of the preprocessor, the productions
</p>

<p>
preprocessor-conditional: if-line text elif-parts else-part<sub>opt</sub> # endif elif-parts: elif-line text elif-parts<sub>opt</sub> 
should be written
</p>

<p>
preprocessor-conditional: if-line text elif-parts<sub>opt</sub> else-part<sub>opt</sub> # endif elif-parts: elif-line text elif-parts<sub>opt</sub> 
244(§B1.2): In table B-1, the argument corresponding to o, u, x, X is unsigned int.
</p>

<p>
245(§B1.2): vprintf, vfprintf, vsprintf return int.
</p>

<p>
245(§B1.3, and also at p. 157 §7.4): The scanf functions do not ignore white space in formats; if white space occurs at a place in the format, any white space in the corresponding input is skipped.
</p>

<p>
246(§B1.3): In table B-2, arguments corresponding to o, x, X, u are unsigned int *.
</p>

<p>
246(§B1.3): First argument of sscanf should have type const char *.
</p>

<p>
249(§B3): In the description of strncpy, t should be ct.
</p>

<p>
210(§A8.1): It is said that a register object cannot have the &amp; operator applied `explicitly or implicitly,’ which is true, but needs an amplifying clause to show that the implicit &amp; comes from mention of an array name, so declaring an array as a register is fruitless.
</p>

<p>
There is no mention of the offsetof macro in §B.
</p>

<p>
257,258(§B11): In the definitions of both <code>FLT_MAX_EXP</code> and <code>DBL_MAX_EXP</code>, the expression <code>FLT_RADIX^n – 1</code> should be written <code>FLT_RADIX^(n-1)</code>.
</p>

<p>
Index: stddef.h is listed but not summarized in the text; It needs a section in Appendix B.
</p>

<p>
char, double, long, short are on page 9, not page 10. sizeof is on 242, not 247. “byte” is not indexed. size<sub>t</sub> does occur on p. 247 in declarations.
</p>

<p>
Updated Oct 23 2006 with program bug on line 136
</p>

<p>
Copyright © 2002 Lucent Technologies. All rights reserved.
</p>

<p>
<a href="http://cm.bell-labs.com/cm/cs/cbook/2ediffs.html">http://cm.bell-labs.com/cm/cs/cbook/2ediffs.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-01-26 Thu 21:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
